tutorials/CFD/11UnsteadyBBOpen/0/Tlift1
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Tlift1;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   nonuniform List<scalar> 
22000
(
0.00442481
0.0132748
0.0221262
0.0309796
0.0398361
0.0486964
0.0575616
0.0664325
...
)
;

boundaryField
{
    Adiabatic_walls
    {
        type            zeroGradient;
    }
    Left
    {
        type            fixedValue;
        value           uniform 0;
    }
    Right
    {
        type            fixedValue;
        value           uniform 1;
    }
    Inlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    Outlet
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
